backend-api/app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `username` = 'manuel'
 LIMIT 1
---
    public function login()
    {
        $userModel = new UserModel();

        // Tangkap input dari VueJS
        $json = $this->request->getJSON();
        $username = $json ? $json->username : $this->request->getVar('username');
        $password = $json ? $json->password : $this->request->getVar('password');

        // Cari user berdasarkan username di database
        $user = $userModel->where('username', $username)->first();

SELECT *
FROM `users`
WHERE `username` = 'rayzal'
 LIMIT 1
INSERT INTO `users` (`username`, `password`, `role`) VALUES ('rayzal', '$2y$10$vOYo3Nx.c2XZN.sjy57HL.sbYXI8uIFcpAY/hV5M2oT0jtcAT.lmC', 'member')
---
    public function register()
    {
        $userModel = new UserModel();

        // Tangkap input dari VueJS
        $json = $this->request->getJSON();
        $username = $json ? $json->username : $this->request->getVar('username');
        $password = $json ? $json->password : $this->request->getVar('password');

        // Cek apakah username sudah dipakai orang lain
        $cekUser = $userModel->where('username', $username)->first();
        if ($cekUser) {
            return $this->fail('Username sudah terdaftar, silakan pilih yang lain.', 400);
        }

        // Simpan data ke database
        $data = [
            'username' => $username,
            // Wajib di-hash agar aman dan bisa dibaca oleh fungsi login kita sebelumnya
            'password' => password_hash($password, PASSWORD_BCRYPT),
            'role'     => 'member' // Otomatis mendaftar sebagai member
        ];

        $userModel->insert($data);