backend-api/app/Controllers/Buku.php

    public function index()
    {
        $model = new BukuModel();
        $data = $model->findAll();
---
SELECT *
FROM `buku`