backend-api/app/Controllers/Peminjaman.php

SELECT *
FROM `peminjaman`
---
    public function index()
    {
        $model = new PeminjamanModel();
        // Nanti di tingkat lanjut, kita bisa lakukan 'join' untuk menampilkan nama buku dan user
        $data = $model->findAll();

SELECT *
FROM `buku`
WHERE `buku`.`id` = '4'
---
    public function create()
    {
        $peminjamanModel = new PeminjamanModel();
        $bukuModel = new BukuModel();

        // Tangkap data dari request
        $json = $this->request->getJSON();
        if ($json) {
            $data = [
                'user_id' => $json->user_id,
                'buku_id' => $json->buku_id,
                'tanggal' => $json->tanggal,
                'status'  => 'dipinjam' // Status default saat baru pinjam
            ];
        } else {
            $data = [
                'user_id' => $this->request->getVar('user_id'),
                'buku_id' => $this->request->getVar('buku_id'),
                'tanggal' => $this->request->getVar('tanggal'),
                'status'  => 'dipinjam'
            ];
        }

        // --- LOGIKA STOK BUKU ---
        $buku = $bukuModel->find($data['buku_id']);

UPDATE `buku` SET `stok` = 4
WHERE `buku`.`id` IN ('4')
INSERT INTO `peminjaman` (`user_id`, `buku_id`, `tanggal`, `status`) VALUES ('2', '4', '2026-06-16', 'dipinjam')
---

        // Kurangi stok buku
        $stokBaru = $buku['stok'] - 1;
        $bukuModel->update($data['buku_id'], ['stok' => $stokBaru]);

        // Simpan transaksi peminjaman
        $peminjamanModel->insert($data);

SELECT *
FROM `peminjaman`
WHERE `peminjaman`.`id` = '1'
SELECT *
FROM `buku`
WHERE `buku`.`id` = '4'
UPDATE `buku` SET `stok` = 5
WHERE `buku`.`id` IN ('4')
UPDATE `peminjaman` SET `status` = 'dikembalikan'
WHERE `peminjaman`.`id` IN ('1')
---
    public function update($id = null)
    {
        $peminjamanModel = new PeminjamanModel();
        $bukuModel = new BukuModel();

        $transaksiLama = $peminjamanModel->find($id);
        if (!$transaksiLama) {
            return $this->failNotFound('Data peminjaman tidak ditemukan.');
        }

        $json = $this->request->getJSON();
        $statusBaru = $json ? $json->status : $this->request->getRawInputVar('status');

        // Jika status diubah dari 'dipinjam' menjadi 'dikembalikan'
        if ($transaksiLama['status'] === 'dipinjam' && $statusBaru === 'dikembalikan') {
            // Tambah kembali stok buku
            $buku = $bukuModel->find($transaksiLama['buku_id']);
            if ($buku) {
                $stokBaru = $buku['stok'] + 1;
                $bukuModel->update($transaksiLama['buku_id'], ['stok' => $stokBaru]);
            }
        }

        // Update status di tabel peminjaman
        $peminjamanModel->update($id, ['status' => $statusBaru]);