backend-api/app/Controllers/Users.php

SELECT *
FROM `users`
---
    public function index()
    {
        $model = new UserModel();
        $data = $model->findAll();